posts/python-decorator/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Python 装饰器（Decorator） | Astropeak</title>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link href="../../assets/css/custom.css" rel="stylesheet" type="text/css">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
            <h1 class="site-title">
                <a href="https://astropeak.github.io/" title="Astropeak" rel="home">Astropeak</a>
            </h1>
        </div>
        <nav class="site-navigation" role="navigation"><div class="menu-toggle">
                <span class="mobile-site-title">Astropeak</span>
            </div>
            <ul class="menu">
<li><a href="../../archive.html">Archive</a></li>
                    <li><a href="../../categories/">Tags</a></li>
                    <li><a href="../../rss.xml">RSS feed</a></li>
                    <li><a href="http://github.com/astropeak">Github</a></li>
            </ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
        <div class="entry-meta">
            <span class="posted-on">
                Posted on <a href="." rel="bookmark">May 10, 2018</a>
            </span>
        </div>
        <h1>Python 装饰器（Decorator）</h1>
    </div>

        <!-- Page Content -->
    <div class="site-content" role="main">
        <article class="format-standard libretto-long-form"><div class="entry-content">
                <p>
装饰器的语法为 <code>@dec_name</code> ，置于函数定义之前。如：
</p>
<div class="highlight"><pre>
<span></span><span class="kn">import</span> <span class="nn">atexit</span>

<span class="nd">@atexit.register</span>
<span class="k">def</span> <span class="nf">goodbye</span><span class="p">():</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'Goodbye!'</span><span class="p">)</span>

<span class="k">print</span><span class="p">(</span><span class="s1">'Script end here'</span><span class="p">)</span>
</pre></div>
<p>
<code>atexit.register</code> 是一个装饰器，它的作用是将被装饰的函数注册为在程序结束时执行。函数 <code>goodbye</code> 是被装饰的函数。
</p>

<p>
程序的运行结果是：
</p>
<div class="highlight"><pre>
<span></span>Script end here
Goodbye!
</pre></div>
<p>
可见函数 <code>goodbye</code> 在程序结束后被自动调用。
</p>

<p>
另一个常见的例子是 <code>@property</code> ，装饰类的成员函数，将其转换为一个描述符。
</p>
<div class="highlight"><pre>
<span></span><span class="k">class</span> <span class="nc">Foo</span><span class="p">:</span>
  <span class="nd">@property</span>
  <span class="k">def</span> <span class="nf">attr</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'attr called'</span><span class="p">)</span>
    <span class="k">return</span> <span class="s1">'attr value'</span>

<span class="n">foo</span> <span class="o">=</span> <span class="n">Foo</span><span class="p">()</span>
</pre></div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">等价语法</h2>
<div class="outline-text-2" id="text-1">
<p>
语句块
</p>
<div class="highlight"><pre>
<span></span><span class="nd">@atexit.register</span>
<span class="k">def</span> <span class="nf">goodbye</span><span class="p">():</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'Goodbye!'</span><span class="p">)</span>
</pre></div>
<p>
等价于
</p>
<div class="highlight"><pre>
<span></span><span class="k">def</span> <span class="nf">goodbye</span><span class="p">():</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'Goodbye!'</span><span class="p">)</span>
<span class="n">goodbye</span> <span class="o">=</span> <span class="n">atexit</span><span class="o">.</span><span class="n">register</span><span class="p">(</span><span class="n">goodbye</span><span class="p">)</span>
</pre></div>
<p>
这两种写法在作用上完全等价。
</p>

<p>
从第二种写法，更容易看出装饰器的原理。装饰器实际上是一个函数（或callable），其输入、返回值为：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left"> </th>
<th scope="col" class="left">说明</th>
<th scope="col" class="left">示例中的对应</th>
</tr></thead>
<tbody>
<tr>
<td class="left">输入</td>
<td class="left">被装饰的函数</td>
<td class="left">goodbye</td>
</tr>
<tr>
<td class="left">返回值</td>
<td class="left">变换后的函数或任意对象</td>
<td class="left"> </td>
</tr>
</tbody>
</table>
<p>
返回值会被赋值给原来指向输入函数的变量，如示例中的 <code>goodbye</code> 。此时变量 <code>goodbye</code> 将指向装饰器的返回值，而不是原来的函数定义。返回值一般为一个函数，这个函数是在输入参数函数添加了一些额外操作的版本。
</p>

<p>
如下面这个装饰器对原始函数添加了一个操作：每次调用这个函数时，打印函数的输入参数及返回值。
</p>
<div class="highlight"><pre>
<span></span><span class="k">def</span> <span class="nf">trace</span><span class="p">(</span><span class="n">func</span><span class="p">):</span>
  <span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">):</span> <span class="c1"></span>  <span class="numberCircle unselectable">1</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Enter. Args: </span><span class="si">%s</span><span class="s1">, kwargs: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">args</span><span class="p">,</span> <span class="n">kwargs</span><span class="p">))</span> <span class="c1"></span>  <span class="numberCircle unselectable">2</span>
    <span class="n">rv</span> <span class="o">=</span> <span class="n">func</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">)</span> <span class="c1"></span>  <span class="numberCircle unselectable">3</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Exit. Return value: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">rv</span><span class="p">))</span> <span class="c1"></span>  <span class="numberCircle unselectable">4</span>
    <span class="k">return</span> <span class="n">rv</span>

  <span class="k">return</span> <span class="n">wrapper</span>

<span class="nd">@trace</span>
<span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">):</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'area called'</span><span class="p">)</span>
  <span class="k">return</span> <span class="n">height</span> <span class="o">*</span> <span class="n">width</span>

<span class="n">area</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span> <span class="c1"></span>  <span class="numberCircle unselectable">5</span>
</pre></div>
<ol class="org-ol">
<li>
<b>1</b> ：定义一个新函数，这个函数将作为装饰器的返回值，来替换原函数
</li>
<li>
<b>2</b>, <b>4</b> ： 打印输入参数、返回值。这是这个装饰器所定义的操作
</li>

<li>
<b>3</b> ：调用原函数
</li>
<li>
<b>5</b> ：此时 <code>area</code> 实际上是 <b>1</b> 处定义的 <code>wrapper</code> 函数
</li>
</ol>
<p>
程序的运行结果为：
</p>
<div class="highlight"><pre>
<span></span>Enter. Args: (2, 3), kwargs: {}
area called
Exit. Return value: 6
</pre></div>
<p>
如果不使用装饰器，则必须将以上打印输入参数及返回值的语句直接写在 <code>area</code> 函数里，如：
</p>
<div class="highlight"><pre>
<span></span><span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">):</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'Enter. Args: </span><span class="si">%s</span><span class="s1">, </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">))</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'area called'</span><span class="p">)</span>
  <span class="n">rv</span> <span class="o">=</span> <span class="n">height</span> <span class="o">*</span> <span class="n">width</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'Exit. Return value: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">rv</span><span class="p">))</span>
  <span class="k">return</span> <span class="n">rv</span>

<span class="n">area</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span>
</pre></div>

<p>
程序的运行结果与使用装饰器时相同。但使用装饰器的好处为：
</p>
<ol class="org-ol">
<li>打印输入参数及返回值这个操作可被重用

<p>
如对于一个新的函数 <code>foo</code> ，装饰器 <code>trace</code> 可以直接拿来使用，而无须在函数内部重复写两条 <code>print</code> 语句。
</p>
<div class="highlight"><pre>
<span></span><span class="nd">@trace</span>
<span class="k">def</span> <span class="nf">foo</span><span class="p">(</span><span class="n">val</span><span class="p">):</span>
  <span class="k">return</span> <span class="s1">'return value'</span>
</pre></div>

<blockquote>
<p>
一个装饰器实际上定义了一种可重复使用的操作
</p>
</blockquote>
</li>
<li>函数的功能更单纯

<p>
 <code>area</code> 函数的功能是计算面积，而调试语句与其功能无关。使用装饰器可以将与函数功能无关的语句提取出来。
因此函数可以写地更小。
</p>

<blockquote>
<p>
使用装饰器，相当于将两个小函数组合起来，组成功能更强大的函数
</p>
</blockquote>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">修正名称</h2>
<div class="outline-text-2" id="text-2">
<p>
以上例子中有一个缺陷，函数 <code>area</code> 被 <code>trace</code> 装饰后，其名称变为 <code>wrapper</code> ，而非 <code>area</code> 。 <code>print(area)</code> 的结果为：
</p>
<div class="highlight"><pre>
<span></span>&lt;function wrapper at 0x10df45668&gt;
</pre></div>
<p>
<code>wrapper</code> 这个名称来源于 <code>trace</code> 中定义的 <code>wrapper</code> 函数。
</p>

<p>
可以通过 <code>functools.wraps</code> 来修正这个问题。
</p>
<div class="highlight"><pre>
<span class="codeH"><span></span><span class="kn">from</span> <span class="nn">functools</span> <span class="kn">import</span> <span class="n">wraps</span> <span class="c1"></span></span>

<span class="k">def</span> <span class="nf">trace</span><span class="p">(</span><span class="n">func</span><span class="p">):</span>
<span class="codeH">  <span class="nd">@wraps</span><span class="p">(</span><span class="n">func</span><span class="p">)</span> <span class="c1"></span></span>
  <span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Enter. Args: </span><span class="si">%s</span><span class="s1">, kwargs: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">args</span><span class="p">,</span> <span class="n">kwargs</span><span class="p">))</span>
    <span class="n">rv</span> <span class="o">=</span> <span class="n">func</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">)</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">'Exit. Return value: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">rv</span><span class="p">))</span>
    <span class="k">return</span> <span class="n">rv</span>

  <span class="k">return</span> <span class="n">wrapper</span>

<span class="nd">@trace</span>
<span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">):</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'area called'</span><span class="p">)</span>
  <span class="k">return</span> <span class="n">height</span> <span class="o">*</span> <span class="n">width</span>
</pre></div>

<p>
即使用 <code>functools.wraps</code> 来装饰 <code>wrapper</code> 。此时 <code>print(area)</code> 的结果为：
</p>
<div class="highlight"><pre>
<span></span>&lt;function area at 0x10e8371b8&gt;
</pre></div>
<p>
函数的名称能够正确显示。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">接收参数</h2>
<div class="outline-text-2" id="text-3">
<p>
以上例子中 <code>trace</code> 这个装饰器在使用时不接受参数。如果想传入参数，如传入被装饰函数的名称，可以这么做：
</p>
<div class="highlight"><pre>
<span></span><span class="kn">from</span> <span class="nn">functools</span> <span class="kn">import</span> <span class="n">wraps</span>

<span class="k">def</span> <span class="nf">trace</span><span class="p">(</span><span class="n">name</span><span class="p">):</span>
  <span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="n">func</span><span class="p">):</span>
    <span class="nd">@wraps</span><span class="p">(</span><span class="n">func</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">wrapped</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">):</span>
      <span class="k">print</span><span class="p">(</span><span class="s1">'Enter </span><span class="si">%s</span><span class="s1">. Args: </span><span class="si">%s</span><span class="s1">, kwargs: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="n">args</span><span class="p">,</span> <span class="n">kwargs</span><span class="p">))</span>
      <span class="n">rv</span> <span class="o">=</span> <span class="n">func</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kwargs</span><span class="p">)</span>
      <span class="k">print</span><span class="p">(</span><span class="s1">'Exit </span><span class="si">%s</span><span class="s1">. Return value: </span><span class="si">%s</span><span class="s1">'</span> <span class="o">%</span> <span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="n">rv</span><span class="p">))</span>
      <span class="k">return</span> <span class="n">rv</span>

    <span class="k">return</span> <span class="n">wrapped</span>
  <span class="k">return</span> <span class="n">wrapper</span>

<span class="nd">@trace</span><span class="p">(</span><span class="s1">'area'</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">):</span>
  <span class="k">print</span><span class="p">(</span><span class="s1">'area called'</span><span class="p">)</span>
  <span class="k">return</span> <span class="n">height</span> <span class="o">*</span> <span class="n">width</span>

<span class="n">area</span><span class="p">(</span><span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span>
</pre></div>

<p>
程序的运行结果为：
</p>
<div class="highlight"><pre>
<span></span>Enter area. Args: (2, 3), kwargs: {}
area called
Exit area. Return value: 6
</pre></div>
<p>
将函数名称传入后，在日志同时打印出函数名，日志更加清晰。
</p>

<p>
<code>@trace('area')</code> 是如何工作的？
</p>

<p>
这里其实包含了两个步骤。 <code>@trace('area')</code> 等价于：
</p>
<div class="highlight"><pre>
<span></span><span class="n">dec</span> <span class="o">=</span> <span class="n">trace</span><span class="p">(</span><span class="s1">'area'</span><span class="p">)</span>
<span class="nd">@dec</span>
<span class="k">def</span> <span class="nf">area</span><span class="p">(</span><span class="n">height</span><span class="p">,</span> <span class="n">width</span><span class="p">):</span> <span class="o">...</span>
</pre></div>
<p>
即先触发函数调用 <code>trace('area')</code> ，得到一个返回值，这个返回值为 <code>wrapper</code> 函数。
而这个函数才是真正的装饰器，然后使用这个装饰器装饰函数。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">多重装饰器</h2>
<div class="outline-text-2" id="text-4">
<p>
装饰器可以叠加使用，如：
</p>
<div class="highlight"><pre>
<span></span><span class="nd">@dec1</span>
<span class="nd">@dec2</span>
<span class="k">def</span> <span class="nf">foo</span><span class="p">():</span><span class="k">pass</span>
</pre></div>
<p>
等价的代码为：
</p>
<div class="highlight"><pre>
<span></span><span class="k">def</span> <span class="nf">foo</span><span class="p">():</span><span class="k">pass</span>
<span class="n">foo</span> <span class="o">=</span> <span class="n">dec2</span><span class="p">(</span><span class="n">foo</span><span class="p">)</span>
<span class="n">foo</span> <span class="o">=</span> <span class="n">dec1</span><span class="p">(</span><span class="n">foo</span><span class="p">)</span>
</pre></div>

<p>
即装饰器依次装饰函数，靠近函数定义的装饰器优先。相当于串联起来。
</p>
</div>
</div>
            </div>
        </article>
</div>

        <!-- Tag Section -->
    <div class="site-content navigation-post">
        <div class="tag-head">Tags</div>
        <div class="tag-list">
                <a href="../../categories/python/">python</a>
        </div>
    </div>

        <!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
            <a href="../python-descriptor/" rel="prev">
                <span class="meta-nav">Older Post</span>Python描述符（Descriptor）
            </a>
        </div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
            <aside class="widget"><h2 class="widget-title">Astropeak</h2>
                <div class="widget-text">Astropeak's blogs.</div>
            </aside>
</div>
    </section><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
            <p>Contents © 2018         <a href="mailto:astropeak@gmail.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
        </div>
        <div class="social">
            <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>
